scc2425-artillery-tests/benchmark_logs/benchmark_log_targetdesc_Kubernets_Final_test_1_20241214_235522.txt
Running user_register.yaml on http://127.0.0.1/tukano-1/rest
Test run id: tx4kq_p4grtgcn79kn5ajjwwppr8979gxbn_jbxm
Phase started: simple_post (index: 0, duration: 20s) 23:55:24(+0000)

--------------------------------------
Metrics for period to: 23:55:30(+0000) (width: 5.418s)
--------------------------------------

http.codes.200: ................................................................ 165
http.downloaded_bytes: ......................................................... 17645
http.request_rate: ............................................................. 31/sec
http.requests: ................................................................. 165
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 145
  mean: ........................................................................ 7
  median: ...................................................................... 4
  p95: ......................................................................... 15
  p99: ......................................................................... 51.9
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 145
  mean: ........................................................................ 7
  median: ...................................................................... 4
  p95: ......................................................................... 15
  p99: ......................................................................... 51.9
http.responses: ................................................................ 165
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.200: ................... 55
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  55
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  55
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 4
  max: ......................................................................... 145
  mean: ........................................................................ 13.1
  median: ...................................................................... 7
  p95: ......................................................................... 47
  p99: ......................................................................... 59.7
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 24
  mean: ........................................................................ 4.4
  median: ...................................................................... 4
  p95: ......................................................................... 8.9
  p99: ......................................................................... 13.1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 15
  mean: ........................................................................ 3.4
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 15
vusers.completed: .............................................................. 55
vusers.created: ................................................................ 55
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 55
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12
  max: ......................................................................... 187
  mean: ........................................................................ 26.5
  median: ...................................................................... 19.1
  p95: ......................................................................... 64.7
  p99: ......................................................................... 102.5


Phase completed: simple_post (index: 0, duration: 20s) 23:55:44(+0000)

--------------------------------------
Metrics for period to: 23:55:40(+0000) (width: 9.916s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 32040
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 88
  mean: ........................................................................ 5.7
  median: ...................................................................... 4
  p95: ......................................................................... 12.1
  p99: ......................................................................... 30.3
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 88
  mean: ........................................................................ 5.7
  median: ...................................................................... 4
  p95: ......................................................................... 12.1
  p99: ......................................................................... 30.3
http.responses: ................................................................ 300
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.200: ................... 100
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  100
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  100
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 4
  max: ......................................................................... 34
  mean: ........................................................................ 8.2
  median: ...................................................................... 7
  p95: ......................................................................... 19.1
  p99: ......................................................................... 30.3
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 88
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 7.9
  p99: ......................................................................... 71.5
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 13
  mean: ........................................................................ 3.2
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 8.9
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 11.8
  max: ......................................................................... 132
  mean: ........................................................................ 22.6
  median: ...................................................................... 18.7
  p95: ......................................................................... 38.5
  p99: ......................................................................... 113.3


--------------------------------------
Metrics for period to: 23:55:50(+0000) (width: 4.415s)
--------------------------------------

http.codes.200: ................................................................ 135
http.downloaded_bytes: ......................................................... 14449
http.request_rate: ............................................................. 31/sec
http.requests: ................................................................. 135
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 15
  mean: ........................................................................ 4.6
  median: ...................................................................... 4
  p95: ......................................................................... 8.9
  p99: ......................................................................... 8.9
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 15
  mean: ........................................................................ 4.6
  median: ...................................................................... 4
  p95: ......................................................................... 8.9
  p99: ......................................................................... 8.9
http.responses: ................................................................ 135
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.200: ................... 45
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  45
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  45
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 4
  max: ......................................................................... 11
  mean: ........................................................................ 7
  median: ...................................................................... 7
  p95: ......................................................................... 8.9
  p99: ......................................................................... 8.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 15
  mean: ........................................................................ 4
  median: ...................................................................... 4
  p95: ......................................................................... 5
  p99: ......................................................................... 8.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 6
  mean: ........................................................................ 2.7
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 6
vusers.completed: .............................................................. 45
vusers.created: ................................................................ 45
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 45
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 11.7
  max: ......................................................................... 52.3
  mean: ........................................................................ 18.9
  median: ...................................................................... 18.7
  p95: ......................................................................... 23.8
  p99: ......................................................................... 26.3


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 23:55:46(+0000)
--------------------------------

http.codes.200: ................................................................ 600
http.downloaded_bytes: ......................................................... 64134
http.request_rate: ............................................................. 31/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 145
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 10.9
  p99: ......................................................................... 40.9
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 145
  mean: ........................................................................ 5.8
  median: ...................................................................... 4
  p95: ......................................................................... 10.9
  p99: ......................................................................... 40.9
http.responses: ................................................................ 600
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.200: ................... 200
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  200
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  200
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 4
  max: ......................................................................... 145
  mean: ........................................................................ 9.2
  median: ...................................................................... 7
  p95: ......................................................................... 19.9
  p99: ......................................................................... 51.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 88
  mean: ........................................................................ 5
  median: ...................................................................... 4
  p95: ......................................................................... 7.9
  p99: ......................................................................... 23.8
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 15
  mean: ........................................................................ 3.2
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 13.1
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 11.7
  max: ......................................................................... 187
  mean: ........................................................................ 22.8
  median: ...................................................................... 18.7
  p95: ......................................................................... 42.5
  p99: ......................................................................... 113.3

==================================================

Running upload_shorts.yaml on http://127.0.0.1/tukano-1/rest
Test run id: thgqy_8xtfaycdmpp8tak9ed6mydrdhzhd5_zbdn
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 23:55:48(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 23:55:58(+0000)

Phase started: Main test (index: 1, duration: 30s) 23:55:58(+0000)

--------------------------------------
Metrics for period to: 23:55:50(+0000) (width: 0.076s)
--------------------------------------

http.codes.200: ................................................................ 1
http.codes.204: ................................................................ 1
http.downloaded_bytes: ......................................................... 424
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 2
http.response_time:
  min: ......................................................................... 16
  max: ......................................................................... 19
  mean: ........................................................................ 17.5
  median: ...................................................................... 16
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.response_time.2xx:
  min: ......................................................................... 16
  max: ......................................................................... 19
  mean: ........................................................................ 17.5
  median: ...................................................................... 16
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.responses: ................................................................ 2
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.204: ...... 1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 16
  max: ......................................................................... 16
  mean: ........................................................................ 16
  median: ...................................................................... 16
  p95: ......................................................................... 16
  p99: ......................................................................... 16
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 19
  max: ......................................................................... 19
  mean: ........................................................................ 19
  median: ...................................................................... 19.1
  p95: ......................................................................... 19.1
  p99: ......................................................................... 19.1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 1
vusers.created_by_name.Upload short: ........................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 75.5
  max: ......................................................................... 75.5
  mean: ........................................................................ 75.5
  median: ...................................................................... 76
  p95: ......................................................................... 76
  p99: ......................................................................... 76


--------------------------------------
Metrics for period to: 23:56:00(+0000) (width: 9.519s)
--------------------------------------

http.codes.200: ................................................................ 39
http.codes.204: ................................................................ 39
http.codes.403: ................................................................ 1
http.codes.404: ................................................................ 1
http.downloaded_bytes: ......................................................... 16323
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 80
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 54
  mean: ........................................................................ 9
  median: ...................................................................... 7
  p95: ......................................................................... 16
  p99: ......................................................................... 29.1
http.response_time.2xx:
  min: ......................................................................... 4
  max: ......................................................................... 54
  mean: ........................................................................ 8.8
  median: ...................................................................... 7
  p95: ......................................................................... 15
  p99: ......................................................................... 29.1
http.response_time.4xx:
  min: ......................................................................... 15
  max: ......................................................................... 16
  mean: ........................................................................ 15.5
  median: ...................................................................... 15
  p95: ......................................................................... 15
  p99: ......................................................................... 15
http.responses: ................................................................ 80
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.204: ...... 39
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.403: ...... 1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  39
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 29
  mean: ........................................................................ 7
  median: ...................................................................... 6
  p95: ......................................................................... 13.9
  p99: ......................................................................... 15
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 5
  max: ......................................................................... 54
  mean: ........................................................................ 10.9
  median: ...................................................................... 10.1
  p95: ......................................................................... 16.9
  p99: ......................................................................... 18
vusers.completed: .............................................................. 40
vusers.created: ................................................................ 40
vusers.created_by_name.Upload short: ........................................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 15.6
  max: ......................................................................... 80.6
  mean: ........................................................................ 35.6
  median: ...................................................................... 31.5
  p95: ......................................................................... 57.4
  p99: ......................................................................... 61


--------------------------------------
Metrics for period to: 23:56:10(+0000) (width: 9.518s)
--------------------------------------

http.codes.200: ................................................................ 99
http.codes.204: ................................................................ 99
http.codes.403: ................................................................ 1
http.codes.404: ................................................................ 1
http.downloaded_bytes: ......................................................... 41004
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 100
  mean: ........................................................................ 8.4
  median: ...................................................................... 6
  p95: ......................................................................... 16
  p99: ......................................................................... 63.4
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 100
  mean: ........................................................................ 8.3
  median: ...................................................................... 6
  p95: ......................................................................... 13.9
  p99: ......................................................................... 63.4
http.response_time.4xx:
  min: ......................................................................... 7
  max: ......................................................................... 30
  mean: ........................................................................ 18.5
  median: ...................................................................... 7
  p95: ......................................................................... 7
  p99: ......................................................................... 7
http.responses: ................................................................ 200
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.204: ...... 99
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.403: ...... 1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  99
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 3
  max: ......................................................................... 28
  mean: ........................................................................ 5.4
  median: ...................................................................... 5
  p95: ......................................................................... 8.9
  p99: ......................................................................... 16
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 5
  max: ......................................................................... 100
  mean: ........................................................................ 11.3
  median: ...................................................................... 7.9
  p95: ......................................................................... 39.3
  p99: ......................................................................... 71.5
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Upload short: ........................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 13
  max: ......................................................................... 152.3
  mean: ........................................................................ 23.6
  median: ...................................................................... 17.6
  p95: ......................................................................... 50.9
  p99: ......................................................................... 102.5


--------------------------------------
Metrics for period to: 23:56:20(+0000) (width: 9.518s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.204: ................................................................ 100
http.downloaded_bytes: ......................................................... 41538
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 81
  mean: ........................................................................ 6.9
  median: ...................................................................... 6
  p95: ......................................................................... 12.1
  p99: ......................................................................... 40.9
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 81
  mean: ........................................................................ 6.9
  median: ...................................................................... 6
  p95: ......................................................................... 12.1
  p99: ......................................................................... 40.9
http.responses: ................................................................ 200
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.204: ...... 100
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  100
plugins.metrics-by-endpoint.response_time./tukano-1/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 3
  max: ......................................................................... 14
  mean: ........................................................................ 4.7
  median: ...................................................................... 5
  p95: ......................................................................... 7
  p99: ......................................................................... 13.1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 5
  max: ......................................................................... 81
  mean: ........................................................................ 9
  median: ...................................................................... 7
  p95: ......................................................................... 13.9
  p99: ......................................................................... 58.6
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Upload short: ........................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12.9
  max: ......................................................................... 91
  mean: ........................................................................ 18.6
  median: ...................................................................... 15.6
  p95: ......................................................................... 27.9
  p99: ......................................................................... 70.1


Phase completed: Main test (index: 1, duration: 30s) 23:56:28(+0000)

--------------------------------------
Metrics for period to: 23:56:30(+0000) (width: 8.435s)
--------------------------------------

http.codes.200: ................................................................ 89
http.codes.204: ................................................................ 89
http.downloaded_bytes: ......................................................... 37154
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 178
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 15
  mean: ........................................................................ 5.9
  median: ...................................................................... 6
  p95: ......................................................................... 10.1
  p99: ......................................................................... 13.1
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 15
  mean: ........................................................................ 5.9
  median: ...................................................................... 6
  p95: ......................................................................... 10.1
  p99: ......................................................................... 13.1
http.responses: ................................................................ 178
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.204: ...... 89
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  89
plugins.metrics-by-endpoint.response_time./tukano-1/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 3
  max: ......................................................................... 12
  mean: ........................................................................ 4.5
  median: ...................................................................... 4
  p95: ......................................................................... 6
  p99: ......................................................................... 10.1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 5
  max: ......................................................................... 15
  mean: ........................................................................ 7.2
  median: ...................................................................... 7
  p95: ......................................................................... 10.9
  p99: ......................................................................... 13.9
vusers.completed: .............................................................. 89
vusers.created: ................................................................ 89
vusers.created_by_name.Upload short: ........................................... 89
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 13.2
  max: ......................................................................... 28.1
  mean: ........................................................................ 16.3
  median: ...................................................................... 15.3
  p95: ......................................................................... 23.8
  p99: ......................................................................... 27.4


All VUs finished. Total time: 42 seconds

--------------------------------
Summary report @ 23:56:31(+0000)
--------------------------------

http.codes.200: ................................................................ 328
http.codes.204: ................................................................ 328
http.codes.403: ................................................................ 2
http.codes.404: ................................................................ 2
http.downloaded_bytes: ......................................................... 136443
http.request_rate: ............................................................. 19/sec
http.requests: ................................................................. 660
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 100
  mean: ........................................................................ 7.3
  median: ...................................................................... 6
  p95: ......................................................................... 13.1
  p99: ......................................................................... 40.9
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 100
  mean: ........................................................................ 7.3
  median: ...................................................................... 6
  p95: ......................................................................... 13.1
  p99: ......................................................................... 40.9
http.response_time.4xx:
  min: ......................................................................... 7
  max: ......................................................................... 30
  mean: ........................................................................ 17
  median: ...................................................................... 15
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.responses: ................................................................ 660
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.204: ...... 328
plugins.metrics-by-endpoint./tukano-1/rest/blobs/{{ blobUrl }}.codes.403: ...... 2
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  328
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}...  2
plugins.metrics-by-endpoint.response_time./tukano-1/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 3
  max: ......................................................................... 29
  mean: ........................................................................ 5.2
  median: ...................................................................... 5
  p95: ......................................................................... 8.9
  p99: ......................................................................... 15
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 5
  max: ......................................................................... 100
  mean: ........................................................................ 9.5
  median: ...................................................................... 7
  p95: ......................................................................... 16
  p99: ......................................................................... 58.6
vusers.completed: .............................................................. 330
vusers.created: ................................................................ 330
vusers.created_by_name.Upload short: ........................................... 330
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12.9
  max: ......................................................................... 152.3
  mean: ........................................................................ 21.7
  median: ...................................................................... 16.6
  p95: ......................................................................... 46.1
  p99: ......................................................................... 80.6

==================================================